lectures/vscode/vscode_lecture2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 Thu 09:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 2: BibTeX and Vim</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jang Soo Kim" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Lecture 2: BibTeX and Vim</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org17c94f1">1. BibTeX</a>
<ul>
<li><a href="#org6cba7f2">1.1. Overview</a></li>
<li><a href="#orgef7a6a2">1.2. Entries in BibTeX file</a></li>
<li><a href="#org84e9d99">1.3. BibTeX entries from Google Scholar</a></li>
<li><a href="#org377b1cb">1.4. JabRef</a></li>
<li><a href="#org3c6d97c">1.5. bbl file</a></li>
</ul>
</li>
<li><a href="#orgff0a3fe">2. Code Ace Jumper (extension)</a>
<ul>
<li><a href="#org345ee65">2.1. Overview</a></li>
<li><a href="#org7466118">2.2. Add Keyboard shortcuts</a></li>
<li><a href="#org938ba39">2.3. Change some options</a>
<ul>
<li><a href="#org23950b2">2.3.1. Redefine "words"</a></li>
<li><a href="#org1e0f656">2.3.2. Change the background color</a></li>
<li><a href="#org84ab64b">2.3.3. Change the scroll mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb91b7a7">3. Vim (extension)</a>
<ul>
<li><a href="#org05ac0fa">3.1. Overview</a></li>
<li><a href="#orge7f6515">3.2. Installation</a></li>
<li><a href="#org5f5411f">3.3. Changing modes</a></li>
<li><a href="#org4dfe189">3.4. Movements (Normal Mode)</a></li>
<li><a href="#org150b296">3.5. Editing (Normal Mode)</a></li>
<li><a href="#orgdac160c">3.6. Visual Mode</a></li>
<li><a href="#org83b1a59">3.7. Finding a letter (Normal Mode)</a></li>
<li><a href="#orgadfc96e">3.8. Finding a word (Normal Mode)</a></li>
<li><a href="#org59454b1">3.9. Other useful commands (Normal Mode)</a></li>
<li><a href="#orgc47108e">3.10. Useful combos</a></li>
<li><a href="#org5999d71">3.11. Registers</a></li>
<li><a href="#org2b2bffc">3.12. Mark positions</a></li>
<li><a href="#orgdc7a91d">3.13. Dot: Repeat the previous command.</a></li>
<li><a href="#org8a9c0a8">3.14. Macros</a>
<ul>
<li><a href="#org62cb6a3">3.14.1. Example</a></li>
<li><a href="#orgf5d58bd">3.14.2. Exercises</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org17c94f1" class="outline-2">
<h2 id="org17c94f1"><span class="section-number-2">1</span> BibTeX</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6cba7f2" class="outline-3">
<h3 id="org6cba7f2"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>BibTeX is a program used for generating references.</li>
<li>First you need a BibTeX file.</li>
<li><p>
Then you need to have the following two lines in you tex file:
</p>
<pre class="example">
\bibliographystyle{STYLE}
\bibliography{BIBFILE}
</pre></li>
<li><code>STYLE</code> can be <code>abbrv</code>, <code>alpha</code>, <code>plain</code>, etc.</li>
<li><p>
<code>BIBFILE</code> is the location of your BibTeX, for example, something like this:
</p>
<pre class="example">
/Users/jangsookim/bibtex/ref.bib
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgef7a6a2" class="outline-3">
<h3 id="orgef7a6a2"><span class="section-number-3">1.2</span> Entries in BibTeX file</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><p>
A BibTeX file has entries like this:
</p>
<pre class="example">
@article{Bressoud1979,
  title={A generalization of the {R}ogers-{R}amanujan
         identities for all moduli},
  author={Bressoud, David M},
  journal={Journal of Combinatorial Theory, Series A},
  volume={27},
  number={1},
  pages={64--68},
  year={1979},
}
</pre></li>
<li>To cite this paper you can type <code>\cite{Bressoud1979}</code> in your tex file.</li>
<li>Note that in the title you must use <code>{ }</code> for capital letters as above.</li>
</ul>
</div>
</div>

<div id="outline-container-org84e9d99" class="outline-3">
<h3 id="org84e9d99"><span class="section-number-3">1.3</span> BibTeX entries from Google Scholar</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Search the paper you want to cite in Google Scholar.
<a href="https://scholar.google.com/">https://scholar.google.com/</a></li>
<li>Google Scholar will show a thumbnail for that paper.</li>
<li>Click <code>"</code> at the bottom of the thumbnail.</li>
<li>Click the BibTeX icon at the bottom.</li>
<li>You can copy the text into you BibTeX file.</li>
</ol>
</div>
</div>

<div id="outline-container-org377b1cb" class="outline-3">
<h3 id="org377b1cb"><span class="section-number-3">1.4</span> JabRef</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>JabRef is a free BibTeX Manager.</li>
<li>Download here: <a href="http://www.jabref.org/">http://www.jabref.org/</a></li>
<li>JabRef is useful when your BibTeX file has many entries.</li>
<li>Using JabRef you can add a new entry directly from "Web search" at the
bottom left corner.</li>
<li>I couldn't find any BibTeX managers in VS Code extensions. Let me know if
you find one.</li>
</ul>
</div>
</div>
<div id="outline-container-org3c6d97c" class="outline-3">
<h3 id="org3c6d97c"><span class="section-number-3">1.5</span> bbl file</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>If you compile bibtex, it will generate a bbl file <code>TEXFILENAME.bbl</code>, where
<code>TEXFILENAME</code> is your tex filename.</li>
<li>This file contains all bibitems you need in your tex file.</li>
<li>You can copy everything in this file and paste it at the end of your tex file.</li>
<li>After this you no longer need your BibTeX file.</li>
<li>This may be helpful if you want to have a single stand-alone tex file.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgff0a3fe" class="outline-2">
<h2 id="orgff0a3fe"><span class="section-number-2">2</span> Code Ace Jumper (extension)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org345ee65" class="outline-3">
<h3 id="org345ee65"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Code Ace Jumper is an extension that allows you to jump around your file.</li>
<li>How to use:
<ol class="org-ol">
<li>Execute "AceJump: Jump".</li>
<li>Type a letter, say <code>d</code>, and it will assign a letter (or two or more) to
each word starting with <code>d</code>.</li>
<li>Type the letter assigned to the word that you want to move.</li>
</ol></li>
<li>There are three more commands like this.</li>
<li>First, you need to assign keyboard shortcuts for these commands.</li>
</ul>
</div>
</div>
<div id="outline-container-org7466118" class="outline-3">
<h3 id="org7466118"><span class="section-number-3">2.2</span> Add Keyboard shortcuts</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>CP \(\rightarrow\) Preferences: Open Keyboard Shortcuts</li>
<li>Search "ace jump".</li>
<li>You can assign a keyboard shortcut by double clicking each command. For
example, 
<ul class="org-ul">
<li>AceJump: Jump \(\rightarrow\) <b>CMD+J J</b></li>
<li>AceJump: Line \(\rightarrow\) <b>CMD+J L</b></li>
<li>AceJump: MultiChar \(\rightarrow\) <b>CMD+J M</b></li>
<li>AceJump: Selection \(\rightarrow\) <b>CMD+J S</b></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org938ba39" class="outline-3">
<h3 id="org938ba39"><span class="section-number-3">2.3</span> Change some options</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org23950b2" class="outline-4">
<h4 id="org23950b2"><span class="section-number-4">2.3.1</span> Redefine "words"</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>We want to make the <code>f</code> in <code>\frac</code> or in <code>$f$</code> as the start of a word.</li>
<li>CP \(\rightarrow\) Preferences: Open Settings (UI). (or <code>CMD+,</code> for a shortcut)</li>
<li>Search "Ace Jump &gt; Finder: Pattern".</li>
<li><p>
Add <code>\\$</code> at the end, just before <code>]</code> in 
</p>
<pre class="example">
[,-.{_("'&lt;\[ ]
</pre>

<p>
so that it looks like this:
</p>
<pre class="example">
[,-.{_("'&lt;\[ \\$]
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org1e0f656" class="outline-4">
<h4 id="org1e0f656"><span class="section-number-4">2.3.2</span> Change the background color</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>Enter "yellow" in "Ace Jump &gt; Placeholder: Background Color".</li>
</ul>
</div>
</div>
<div id="outline-container-org84ab64b" class="outline-4">
<h4 id="org84ab64b"><span class="section-number-4">2.3.3</span> Change the scroll mode</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>Set "none" in "Ace Jump &gt; Scroll:Mode".</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb91b7a7" class="outline-2">
<h2 id="orgb91b7a7"><span class="section-number-2">3</span> Vim (extension)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org05ac0fa" class="outline-3">
<h3 id="org05ac0fa"><span class="section-number-3">3.1</span> Overview</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Vim is a modal editor meaning that it has several modes.
<ul class="org-ul">
<li>Normal mode: used for editor commands</li>
<li>Insert mode: used for inserting text</li>
<li>Command-line mode: used for doing some commands</li>
</ul></li>
<li>Vim Extension allows us to use Vim commands inside VS Code.</li>
<li>Vim graphical cheat sheet<br />
<a href="https://eggplant.pro/blog/wp-content/uploads/2016/12/vi-vim-tutorial.pdf">https://eggplant.pro/blog/wp-content/uploads/2016/12/vi-vim-tutorial.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge7f6515" class="outline-3">
<h3 id="orge7f6515"><span class="section-number-3">3.2</span> Installation</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>First you need to install Vim using "Extensions" icon as before.</li>
<li>Once you have Vim installed, you can use Vim commands immediately.</li>
<li>You can disable Vim as follows.
<ol class="org-ol">
<li>Click Vim in "Extensions".</li>
<li>Click "Disable".</li>
</ol></li>
</ul>
</div>
</div>
