lectures/vscode/vscode_lecture2.org
** Changing modes
| key | command                            |
|-----+------------------------------------|
| i   | Change to Insert Mode at cursor    |
| a   | Change to Insert Mode after cursor |
| ESC | Change to Normal Mode              |
| :   | Change to Command-line Mode        |
** Movements (Normal Mode)
| key        | command               |
|------------+-----------------------|
| h, j, k, l | left, down, up, right |
| w          | next word             |
| b          | previous word         |
| CTRL+f     | page forward          |
| CTRL+b     | page backward         |
#+ATTR_REVEAL: :frag (roll-in)
    - Typing ~n~ will repeat the following command n times.
    - For example, ~4w~ is equivalent to ~wwww~.
    - You can still use the arrow keys, but it's not recommended.
** Editing (Normal Mode)
| key | command                     |
|-----+-----------------------------|
| y   | yank something              |
| d   | delete something            |
| p   | paste after                 |
| P   | paste before                |
| x   | delete letter at cursor |
#+ATTR_REVEAL: :frag (roll-in)
    - Deleted text is always copied in clipboard.
    - You can make a sentence using these.
    - ~yy~ : yank line
    - ~dd~ : delete line
    - ~dw~ : delete word

** Visual Mode
| key | command                           |
|-----+-----------------------------------|
| v   | Change to Visual Mode             |
| V   | Change to Visual Mode (line-wise) |
#+ATTR_REVEAL: :frag (roll-in)
    - Visual Mode highlights a region.
    - In Visual Mode, ~y~ yanks the content in the selected region.
    - In Visual Mode, ~d~ deletes the content in the selected region.


** Finding a letter (Normal Mode)
| key       | command                                     |
|-----------+---------------------------------------------|
| f $\star$ | Move cursor to $\star$ in current line.     |
| t $\star$ | Move cursor before $\star$ in current line. |
| F $\star$ | Similar to "f" but backward.                |
| T $\star$ | Similar to "t" but backward.                |
| ;         | Repeat the previous finding command.        |
    - $\star$ is a letter you need to type after ~f~, ~t~, etc.
** Finding a word (Normal Mode)
| key | command                 |
|-----+-------------------------|
| ~/~ | Find a word.            |
| n   | Find the next word.     |
| N   | Find the previous word. |
#+ATTR_REVEAL: :frag (roll-in)
    - ~/abc ENTER~ will move the cursor after the first occurrence of the word
      ~abc~.
    - ~n~ will find the next occurrence of the word.
    - ~N~ will find the previous occurrence of the word.
** Other useful commands (Normal Mode)
| key    | command                 |
|--------+-------------------------|
| u      | Undo                    |
| CTRL+r | Redo                    |
| 0      | beginning of line       |
| $      | end of line             |
| gg     | beginning of the file   |
| G      | end of the file         |
| zt     | scroll cursor to top    |
| zb     | scroll cursor to bottom |
| zz     | scroll cursor to center |

** Useful combos
#+ATTR_REVEAL: :frag (roll-in)
   - ~yf$~: If you are at the beginning of an inline math mode ~$~, then ~yf$~
      can copy the whole math expression.
   - ~yt$~: Similar, but ~$~ is excluded.
   - ~dt.~: This will delete up to the period.
   - ~xp~: This will swap two letters.
   - Selecting a whole section: (cursor at \section{ABC})
      : V / \\section Enter k
   - Selecting a whole file: ~gg V G~

** Registers
#+ATTR_REVEAL: :frag (roll-in)
   - You can store something in a register.
   - The easiest way is as follows:
     1. Select a region that you want to register.
     2. Type ~ay~, where ~a~ can be any letter.
     3. This will register the content of the region at register ~a~.
     4. Type ~ap~ or ~aP~ to insert the content at register ~a~.
   - To view the registers type the following.\\
     ~:reg ENTER~
** Mark positions
#+ATTR_REVEAL: :frag (roll-in)
   - You can mark the current position for future use.
     1. ~ma~ marks the current position by ~a~, where ~a~ can be any letter.
     2. Typing ~`a~ send you back to the position marked by ~a~.
   - It's helpful to mark the position where macros are defined.
** Dot: Repeat the previous command.
#+ATTR_REVEAL: :frag (roll-in)
   - ~.~ repeats the previously performed command.
   - For example, ~dd~ deletes the line at cursor. Pressing ~.~ will delete
     another line.
   - When used carefully, this dot command can be very effective.
   - More complicated tasks can be done by macros.

