lectures/vscode/vscode_lecture2.html
<div id="outline-container-org5f5411f" class="outline-3">
<h3 id="org5f5411f"><span class="section-number-3">3.3</span> Changing modes</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">i</td>
<td class="org-left">Change to Insert Mode at cursor</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">Change to Insert Mode after cursor</td>
</tr>

<tr>
<td class="org-left">ESC</td>
<td class="org-left">Change to Normal Mode</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">Change to Command-line Mode</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4dfe189" class="outline-3">
<h3 id="org4dfe189"><span class="section-number-3">3.4</span> Movements (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">h, j, k, l</td>
<td class="org-left">left, down, up, right</td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">next word</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">previous word</td>
</tr>

<tr>
<td class="org-left">CTRL+f</td>
<td class="org-left">page forward</td>
</tr>

<tr>
<td class="org-left">CTRL+b</td>
<td class="org-left">page backward</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Typing <code>n</code> will repeat the following command n times.</li>
<li>For example, <code>4w</code> is equivalent to <code>wwww</code>.</li>
<li>You can still use the arrow keys, but it's not recommended.</li>
</ul>
</div>
</div>
<div id="outline-container-org150b296" class="outline-3">
<h3 id="org150b296"><span class="section-number-3">3.5</span> Editing (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">y</td>
<td class="org-left">yank something</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">delete something</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">paste after</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">paste before</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">delete letter at cursor</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Deleted text is always copied in clipboard.</li>
<li>You can make a sentence using these.</li>
<li><code>yy</code> : yank line</li>
<li><code>dd</code> : delete line</li>
<li><code>dw</code> : delete word</li>
</ul>
</div>
</div>

<div id="outline-container-orgdac160c" class="outline-3">
<h3 id="orgdac160c"><span class="section-number-3">3.6</span> Visual Mode</h3>
<div class="outline-text-3" id="text-3-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">v</td>
<td class="org-left">Change to Visual Mode</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left">Change to Visual Mode (line-wise)</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Visual Mode highlights a region.</li>
<li>In Visual Mode, <code>y</code> yanks the content in the selected region.</li>
<li>In Visual Mode, <code>d</code> deletes the content in the selected region.</li>
</ul>
</div>
</div>


<div id="outline-container-org83b1a59" class="outline-3">
<h3 id="org83b1a59"><span class="section-number-3">3.7</span> Finding a letter (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f \(\star\)</td>
<td class="org-left">Move cursor to \(\star\) in current line.</td>
</tr>

<tr>
<td class="org-left">t \(\star\)</td>
<td class="org-left">Move cursor before \(\star\) in current line.</td>
</tr>

<tr>
<td class="org-left">F \(\star\)</td>
<td class="org-left">Similar to "f" but backward.</td>
</tr>

<tr>
<td class="org-left">T \(\star\)</td>
<td class="org-left">Similar to "t" but backward.</td>
</tr>

<tr>
<td class="org-left">;</td>
<td class="org-left">Repeat the previous finding command.</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>\(\star\) is a letter you need to type after <code>f</code>, <code>t</code>, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-orgadfc96e" class="outline-3">
<h3 id="orgadfc96e"><span class="section-number-3">3.8</span> Finding a word (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">Find a word.</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">Find the next word.</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">Find the previous word.</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><code>/abc ENTER</code> will move the cursor after the first occurrence of the word
<code>abc</code>.</li>
<li><code>n</code> will find the next occurrence of the word.</li>
<li><code>N</code> will find the previous occurrence of the word.</li>
</ul>
</div>
</div>
<div id="outline-container-org59454b1" class="outline-3">
<h3 id="org59454b1"><span class="section-number-3">3.9</span> Other useful commands (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">u</td>
<td class="org-left">Undo</td>
</tr>

<tr>
<td class="org-left">CTRL+r</td>
<td class="org-left">Redo</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">beginning of line</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end of line</td>
</tr>

<tr>
<td class="org-left">gg</td>
<td class="org-left">beginning of the file</td>
</tr>

<tr>
<td class="org-left">G</td>
<td class="org-left">end of the file</td>
</tr>

<tr>
<td class="org-left">zt</td>
<td class="org-left">scroll cursor to top</td>
</tr>

<tr>
<td class="org-left">zb</td>
<td class="org-left">scroll cursor to bottom</td>
</tr>

<tr>
<td class="org-left">zz</td>
<td class="org-left">scroll cursor to center</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc47108e" class="outline-3">
<h3 id="orgc47108e"><span class="section-number-3">3.10</span> Useful combos</h3>
<div class="outline-text-3" id="text-3-10">
<ul class="org-ul">
<li><code>yf$</code>: If you are at the beginning of an inline math mode <code>$</code>, then <code>yf$</code>
can copy the whole math expression.</li>
<li><code>yt$</code>: Similar, but <code>$</code> is excluded.</li>
<li><code>dt.</code>: This will delete up to the period.</li>
<li><code>xp</code>: This will swap two letters.</li>
<li><p>
Selecting a whole section: (cursor at \section{ABC})
</p>
<pre class="example">
V / \\section Enter k
</pre></li>
<li>Selecting a whole file: <code>gg V G</code></li>
</ul>
</div>
</div>

<div id="outline-container-org5999d71" class="outline-3">
<h3 id="org5999d71"><span class="section-number-3">3.11</span> Registers</h3>
<div class="outline-text-3" id="text-3-11">
<ul class="org-ul">
<li>You can store something in a register.</li>
<li>The easiest way is as follows:
<ol class="org-ol">
<li>Select a region that you want to register.</li>
<li>Type <code>ay</code>, where <code>a</code> can be any letter.</li>
<li>This will register the content of the region at register <code>a</code>.</li>
<li>Type <code>ap</code> or <code>aP</code> to insert the content at register <code>a</code>.</li>
</ol></li>
<li>To view the registers type the following.<br />
<code>:reg ENTER</code></li>
</ul>
</div>
</div>
<div id="outline-container-org2b2bffc" class="outline-3">
<h3 id="org2b2bffc"><span class="section-number-3">3.12</span> Mark positions</h3>
<div class="outline-text-3" id="text-3-12">
<ul class="org-ul">
<li>You can mark the current position for future use.
<ol class="org-ol">
<li><code>ma</code> marks the current position by <code>a</code>, where <code>a</code> can be any letter.</li>
<li>Typing <code>`a</code> send you back to the position marked by <code>a</code>.</li>
</ol></li>
<li>It's helpful to mark the position where macros are defined.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc7a91d" class="outline-3">
<h3 id="orgdc7a91d"><span class="section-number-3">3.13</span> Dot: Repeat the previous command.</h3>
<div class="outline-text-3" id="text-3-13">
<ul class="org-ul">
<li><code>.</code> repeats the previously performed command.</li>
<li>For example, <code>dd</code> deletes the line at cursor. Pressing <code>.</code> will delete
another line.</li>
<li>When used carefully, this dot command can be very effective.</li>
<li>More complicated tasks can be done by macros.</li>
</ul>
</div>
</div>
