lectures/vscode/vscode_lecture2.org
** Macros
#+ATTR_REVEAL: :frag (roll-in)
   - ~qa~ followed by ~q~ records all your commands performed between them at
     ~a~.
   - ~@a~ repeats the commands recorded at ~a~.
   - ~@@~ runs the previously performed macro.
   - In order to write more complicated macros, you need to know more Vim
     commands, for example, 
     | key | command           |
     |-----+-------------------|
     | c   | Change something  |
     | e   | end of word       |
     | 0   | beginning of line |
     | $   | end of line       |



*** Example
#+ATTR_REVEAL: :frag (roll-in)
    - We want to insert ~&~ before each ~=~ below.
      : \begin{align*}
      :   a = b,\\
      :   a+a = b+b,\\
      :   a+a+a = b+b+b,\\
      :   a+a+a+a = b+b+b+b.
      : \end{align*}
    - We can do this using a macro like this.
      1. Locate your cursor at the beginning of line 2.
      2. (In Normal Mode) Press ~qa~.
      3. Type ~f = i & ESC k 0~ and ~q~.
      4. Type ~@a~ and then ~@@~ twice.
*** Exercises
    - Replace each pair ~[ ]~ by ~( )~ using a macro (you may use one macro many
      times).
      : \begin{align*}
      :   a[x] = b[x],\\
      :   a[x]+a[y] = b[x]+b[y],\\
      :   a[x]+a[y]+a[z] = b[x]+b[y]+b[z],\\
      :   a[x]+a[y]+a[z]+a[w] = b[x]+b[y]+b[z]+b[w].
      : \end{align*}

