lectures/vscode/vscode_lecture2.html

<div id="outline-container-org8a9c0a8" class="outline-3">
<h3 id="org8a9c0a8"><span class="section-number-3">3.14</span> Macros</h3>
<div class="outline-text-3" id="text-3-14">
<ul class="org-ul">
<li><code>qa</code> followed by <code>q</code> records all your commands performed between them at
<code>a</code>.</li>
<li><code>@a</code> repeats the commands recorded at <code>a</code>.</li>
<li><code>@@</code> runs the previously performed macro.</li>
<li><p>
In order to write more complicated macros, you need to know more Vim
commands, for example, 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-left">Change something</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">end of word</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">beginning of line</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end of line</td>
</tr>
</tbody>
</table></li>
</ul>
</div>



<div id="outline-container-org62cb6a3" class="outline-4">
<h4 id="org62cb6a3"><span class="section-number-4">3.14.1</span> Example</h4>
<div class="outline-text-4" id="text-3-14-1">
<ul class="org-ul">
<li><p>
We want to insert <code>&amp;</code> before each <code>=</code> below.
</p>
<pre class="example">
\begin{align*}
  a = b,\\
  a+a = b+b,\\
  a+a+a = b+b+b,\\
  a+a+a+a = b+b+b+b.
\end{align*}
</pre></li>
<li>We can do this using a macro like this.
<ol class="org-ol">
<li>Locate your cursor at the beginning of line 2.</li>
<li>(In Normal Mode) Press <code>qa</code>.</li>
<li>Type <code>f = i &amp; ESC k 0</code> and <code>q</code>.</li>
<li>Type <code>@a</code> and then <code>@@</code> twice.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgf5d58bd" class="outline-4">
<h4 id="orgf5d58bd"><span class="section-number-4">3.14.2</span> Exercises</h4>
<div class="outline-text-4" id="text-3-14-2">
<ul class="org-ul">
<li><p>
Replace each pair <code>[ ]</code> by <code>( )</code> using a macro (you may use one macro many
times).
</p>
<pre class="example">
\begin{align*}
  a[x] = b[x],\\
  a[x]+a[y] = b[x]+b[y],\\
  a[x]+a[y]+a[z] = b[x]+b[y]+b[z],\\
  a[x]+a[y]+a[z]+a[w] = b[x]+b[y]+b[z]+b[w].
\end{align*}
</pre></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2020-12-03 Thu 09:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
